Revit 2027 API
BuiltInFailures.WallJoinRoofFailures.NotCoveredAtAllByTarget Property
 Highlighted walls are attached to, but miss, the highlighted targets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotCoveredAtAllByTarget { get; }
Public Shared ReadOnly Property NotCoveredAtAllByTarget As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotCoveredAtAllByTarget {
	FailureDefinitionId^ get ();
}
static member NotCoveredAtAllByTarget : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallJoinRoofFailures Class
Autodesk.Revit.DB Namespace